benchmarks/results/auth-serialization/test-signin/final/wrk2-logs/run_1_2605_1126.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signin
  2 threads and 4 connections
  Thread calibration: mean lat.: 526.080ms, rate sampling interval: 1298ms
  Thread calibration: mean lat.: 542.888ms, rate sampling interval: 1318ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   520.95ms  110.52ms 686.08ms   49.15%
    Req/Sec     0.87      0.43     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  474.37ms
 75.000%  635.90ms
 90.000%  676.86ms
 99.000%  683.52ms
 99.900%  686.59ms
 99.990%  686.59ms
 99.999%  686.59ms
100.000%  686.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     358.655     0.000000            1         1.00
     384.767     0.100000            6         1.11
     403.199     0.200000           12         1.25
     429.823     0.300000           18         1.43
     451.327     0.400000           24         1.67
     474.367     0.500000           30         2.00
     556.031     0.550000           33         2.22
     568.319     0.600000           36         2.50
     583.167     0.650000           39         2.86
     629.247     0.700000           43         3.33
     636.927     0.750000           45         4.00
     637.951     0.775000           46         4.44
     645.631     0.800000           49         5.00
     645.631     0.825000           49         5.71
     652.799     0.850000           51         6.67
     665.087     0.875000           52         8.00
     676.863     0.887500           53         8.89
     677.375     0.900000           54        10.00
     677.375     0.912500           54        11.43
     677.887     0.925000           55        13.33
     680.447     0.937500           56        16.00
     680.447     0.943750           56        17.78
     682.495     0.950000           57        20.00
     682.495     0.956250           57        22.86
     682.495     0.962500           57        26.67
     683.519     0.968750           58        32.00
     683.519     0.971875           58        35.56
     683.519     0.975000           58        40.00
     683.519     0.978125           58        45.71
     683.519     0.981250           58        53.33
     686.591     0.984375           59        64.00
     686.591     1.000000           59          inf
#[Mean    =      520.947, StdDeviation   =      110.517]
#[Max     =      686.080, Total count    =           59]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  91 requests in 30.01s, 76.60KB read
Requests/sec:      3.03
Transfer/sec:      2.55KB