benchmarks/results/auth-serialization/test-signin/final/wrk2-logs/run_3_2605_1128.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signin
  2 threads and 4 connections
  Thread calibration: mean lat.: 622.272ms, rate sampling interval: 1297ms
  Thread calibration: mean lat.: 599.552ms, rate sampling interval: 1297ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   616.86ms   41.21ms 662.02ms   68.33%
    Req/Sec     0.87      0.34     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  642.05ms
 75.000%  647.17ms
 90.000%  655.87ms
 99.000%  662.02ms
 99.900%  662.53ms
 99.990%  662.53ms
 99.999%  662.53ms
100.000%  662.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     535.551     0.000000            1         1.00
     546.303     0.100000            6         1.11
     567.295     0.200000           12         1.25
     577.535     0.300000           18         1.43
     621.567     0.400000           24         1.67
     642.047     0.500000           31         2.00
     642.559     0.550000           34         2.22
     643.071     0.600000           36         2.50
     644.607     0.650000           39         2.86
     645.631     0.700000           42         3.33
     647.167     0.750000           45         4.00
     649.215     0.775000           48         4.44
     649.215     0.800000           48         5.00
     651.775     0.825000           50         5.71
     652.287     0.850000           51         6.67
     654.847     0.875000           53         8.00
     655.871     0.887500           54         8.89
     655.871     0.900000           54        10.00
     656.383     0.912500           55        11.43
     657.407     0.925000           57        13.33
     657.407     0.937500           57        16.00
     657.407     0.943750           57        17.78
     657.407     0.950000           57        20.00
     659.967     0.956250           58        22.86
     659.967     0.962500           58        26.67
     662.015     0.968750           59        32.00
     662.015     0.971875           59        35.56
     662.015     0.975000           59        40.00
     662.015     0.978125           59        45.71
     662.015     0.981250           59        53.33
     662.527     0.984375           60        64.00
     662.527     1.000000           60          inf
#[Mean    =      616.858, StdDeviation   =       41.212]
#[Max     =      662.016, Total count    =           60]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  92 requests in 30.01s, 77.45KB read
Requests/sec:      3.07
Transfer/sec:      2.58KB